In [1]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [2]:
df = pd.read_csv("testing")

In [3]:
df = df.drop(columns="Unnamed: 0")

In [4]:
df.shape

(2678, 12)

In [6]:
df["Institute"].unique()

array(['Indian Institute of Technology Bombay',
       'Indian Institute of Technology Kanpur',
       'Indian Institute of Technology Kharagpur',
       'Indian Institute of Technology Madras',
       'Indian Institute of Technology (ISM) Dhanbad',
       'Indian Institute of Technology Roorkee',
       'Indian Institute of Technology (BHU) Varanasi',
       'Indian Institute of Technology Gandhinagar',
       'Indian Institute of Technology Hyderabad',
       'Indian Institute of Technology Jodhpur',
       'Indian Institute of Technology Mandi',
       'Indian Institute of Technology Guwahati',
       'Indian Institute of Technology Dharwad',
       'Indian Institute of Technology Delhi',
       'Indian Institute of Technology Bhubaneswar',
       'Indian Institute of Technology Indore',
       'Indian Institute of Technology Jammu',
       'Indian Institute of Technology Palakkad',
       'Indian Institute of Technology Ropar',
       'Indian Institute of Technology Tirupati',
       'Indian Institute of Technology Bhilai',
       'Indian Institute of Technology Goa'], dtype=object)

In [8]:
df["Seat Type"].unique()

array(['OPEN', 'OPEN (PwD)', 'EWS', 'OBC-NCL', 'OBC-NCL (PwD)', 'SC',
       'ST', 'SC (PwD)', 'EWS (PwD)', 'ST (PwD)'], dtype=object)

In [22]:
# Institute

In [23]:
le = LabelEncoder()
df['Institute'] = le.fit_transform(df['Institute'])
df['Institute'].unique()

array([ 4, 14, 15, 16,  1, 19,  0,  7, 10, 13, 17,  9,  6,  5,  3, 11, 12,
       18, 20, 21,  2,  8])

In [7]:
# Quota

In [25]:
df.dtypes

Institute        int32
Quota           object
Seat Type       object
Gender          object
Opening          int64
Closing          int64
Round            int64
Year             int64
Duration        object
Degree          object
Branch          object
Avg_ranking    float64
dtype: object

In [26]:
le = LabelEncoder()
df['Quota'] = le.fit_transform(df['Quota'])
df['Quota'].unique()

array([0])

In [27]:
le = LabelEncoder()
df['Seat Type'] = le.fit_transform(df['Seat Type'])
df['Seat Type'].unique()

array([4, 5, 0, 2, 3, 6, 8, 7, 1, 9])

In [28]:
le = LabelEncoder()
df['Gender'] = le.fit_transform(df['Gender'])
df['Gender'].unique()

array([1, 0])

In [29]:
le = LabelEncoder()
df['Duration'] = le.fit_transform(df['Duration'])
df['Duration'].unique()

array([0, 1, 2])

In [30]:
le = LabelEncoder()
df['Degree'] = le.fit_transform(df['Degree'])
df['Degree'].unique()

array([5, 0, 1, 4, 3, 2, 6])

In [31]:
le = LabelEncoder()
df['Branch'] = le.fit_transform(df['Branch'])
df['Branch'].unique()

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8, 10, 11, 13, 14, 15, 16, 17, 29,
        9, 18, 21, 12, 19, 20, 22, 23, 28, 24, 27, 25, 26, 30, 31, 32, 33,
       40, 34, 35, 36, 37, 38, 39, 42, 43, 44, 41, 45, 49, 46, 47, 48, 50,
       51, 52, 53, 55, 56, 54, 57, 58, 59, 60, 62, 63, 61, 64, 65, 66, 75,
       67, 68, 69, 70, 71, 74, 72, 73, 77, 76, 78, 79, 80, 81, 82, 83, 84,
       85, 86, 87])

In [32]:
df

,Institute,Quota,Seat Type,Gender,Opening,Closing,Round,Year,Duration,Degree,Branch,Avg_ranking
0,4,0,4,1,772,2568,1,2023,0,5,0,4420.0
1,4,0,4,0,2697,4628,1,2023,0,5,0,8705.0
2,4,0,5,1,49,49,1,2023,0,5,0,127.0
3,4,0,5,0,104,104,1,2023,0,5,0,771.5
4,4,0,0,1,449,614,1,2023,0,5,0,1808.0
...,...,...,...,...,...,...,...,...,...,...,...,...
2673,5,0,2,0,5742,6280,1,2023,0,5,87,7761.0
2674,5,0,6,1,1460,1771,1,2023,0,5,87,1659.5
2675,5,0,6,0,2722,2769,1,2023,0,5,87,2578.0
2676,5,0,8,1,840,984,1,2023,0,5,87,1220.0
2677,5,0,8,0,1578,1578,1,2023,0,5,87,4645.5

In [33]:
df.to_csv("test")

In [34]:
df

,Institute,Quota,Seat Type,Gender,Opening,Closing,Round,Year,Duration,Degree,Branch,Avg_ranking
0,4,0,4,1,772,2568,1,2023,0,5,0,4420.0
1,4,0,4,0,2697,4628,1,2023,0,5,0,8705.0
2,4,0,5,1,49,49,1,2023,0,5,0,127.0
3,4,0,5,0,104,104,1,2023,0,5,0,771.5
4,4,0,0,1,449,614,1,2023,0,5,0,1808.0
...,...,...,...,...,...,...,...,...,...,...,...,...
2673,5,0,2,0,5742,6280,1,2023,0,5,87,7761.0
2674,5,0,6,1,1460,1771,1,2023,0,5,87,1659.5
2675,5,0,6,0,2722,2769,1,2023,0,5,87,2578.0
2676,5,0,8,1,840,984,1,2023,0,5,87,1220.0
2677,5,0,8,0,1578,1578,1,2023,0,5,87,4645.5